{"intents": [
    {"tag": "greeting",
    "patterns": ["Xin chào", "Chào buổi sáng", "Chào buổi tối", "Bạn có khoẻ không", "Có ai không"],
    "responses": ["Xin chào", "Chào mừng đến với Bác Sĩ Lúa", "Xin chào, tôi có thể giúp gì cho bạn?"],
    "context_set": ""
    },
    {"tag": "goodbye",
    "patterns": ["Tạm biệt", "Chúc bạn một ngày tốt lành", "Tôi đi đây", "Gặp lại sau"],
    "responses": ["Tạm biệt", "Chúc bạn một ngày tốt lành", "Cảm ơn đã sử dụng Bác Sĩ Lúa"],
    "context_set": ""
    },
    {"tag": "info",
    "patterns": ["Bạn là ai?", "Bác Sĩ Lúa", "Bác Sĩ Lúa là gì", "Bác Sĩ Lúa có chính xác không?", "Cách sử dụng Bác Sĩ Lúa"],
    "responses": ["Đây là Bác Sĩ Lúa, một phần mềm trí tuệ nhân tạo có thể dự đoán bênh lúa dựa trên hình ảnh", 
                    "Bác Sĩ Lúa là một phần mềm trí tuệ nhân tạo có thể dự đoán bệnh lúa dựa trên hình ảnh",
                     "Bác Sĩ Lúa là một phần mềm có thể dự đoán bênh lúa với độ chính xác 97%", 
                     "Bác Sĩ Lúa là một phần mềm trí tuệ nhân tạo có thể dự đoán bênh lúa dựa trên hình ảnh. Để chẩn đoán bệnh lúa, hãy nhấn \"Browse files\" và chọn ảnh"],
    "context_set": ""

    },
    {"tag": "blight",
    "patterns": ["Bạc lá", "Bạc lá lúa", "Bệnh bạc lá lúa", "Bệnh bạc lá", "Bạc lá là gì", "Cách xử lý bệnh bạc lá", "Cách phòng bênh bạc lá", "Thuốc xử lý bạc lá"],
    "responses": ["Bệnh bạc lá lúa là một căn bệnh phổ biến ở cây lúa. Đây là một căn bệnh do vi khuẩn gây ra, có tên gọi là Xanthomonas oryzae pv. oryzae. Vi khuẩn này tấn công lá cây lúa, gây ra các dấu hiệu như các đốm nhỏ trên lá, lá bị méo, mép lá cạnh nhô lên và cuối cùng là lá cây chết.\nĐể phòng trị bệnh bạc lá lúa, người trồng cây lúa có thể áp dụng các biện pháp sau:\nChọn giống cây lúa kháng bệnh tốt để trồng.\nTrồng cây lúa theo vòng đời 3 lúa (3 năm) để tránh sự tích tụ và lây lan của các tác nhân gây bệnh trên đất.\nTrồng khẩu trang cây lúa, bao bì cây giống, công cụ người làm nông nghiệp để đảm bảo không bị tấn công bởi vi khuẩn gây bệnh.\nPhun thuốc sát khuẩn để ngăn chặn sự lây lan của vi khuẩn trên các cây lúa khác.\nThực hiện đảm bảo vệ sinh đúng cách trong quá trình trồng, bảo quản và thu hoạch lúa.", 
                    "Việc phun thuốc để phòng trị và kiểm soát bệnh bạc lá lúa cần phải được thực hiện đúng cách và đảm bảo an toàn cho sức khỏe con người và môi trường. Việc sử dụng thuốc có thể tùy thuộc vào mức độ lây lan và nhiễm bệnh của cây lúa, do đó bạn nên tham khảo ý kiến của các chuyên gia hoặc cây trồng địa phương để biết cách kiểm soát bệnh bạc lá lúa hiệu quả nhất.\nTuy nhiên, thường sử dụng các loại thuốc như:\nThuốc oxytetracycline: Đây là thuốc kháng khuẩn được sử dụng để ngăn chặn sự lây lan của bệnh bạc lá lúa trên các cây lúa khác.\nThuốc Actigard: Đây là thuốc kháng vi khuẩn có tác dụng tăng cường hệ thống miễn dịch của cây lúa, giúp chúng chống lại sự tấn công của vi khuẩn gây bệnh.\nThuốc Streptomycin: Thuốc này có tính kháng khuẩn và được sử dụng để ngăn chặn sự lây lan của bệnh bạc lá lúa trên các cây lúa khác.\nLưu ý rằng việc sử dụng thuốc chỉ nên được thực hiện sau khi nghiên cứu kỹ và đảm bảo an toàn trong phòng trị và bảo vệ môi trường, người lao động và người tiêu dùng. Nên tuân thủ đúng hướng dẫn sử dụng trên nhãn nhận của từng sản phẩm và thực hiện theo chỉ dẫn của nhà sản xuất và chuyên gia cây trồng."],
    "context_set": ""
    },
    {"tag": "streak",
    "patterns": ["Đốm sọc lá", "Đốm sọc lá lúa", "Bệnh đốm sọc lá", "Đốm sọc lá là gì", "Cách xử lý bệnh đốm sọc lá", "Cách phòng bệnh đốm sọc lá", "Thuốc xử lý đốm sọc lá"],
    "responses": ["Bệnh đốm sọc lá lúa là một căn bệnh thường gặp ở cây lúa, được gây ra bởi một loại nấm có tên gọi là Xanthomonas oryzae pv. oryzicola. Bệnh này có thể gây ra thiệt hại nghiêm trọng cho cây lúa, ảnh hưởng đến sự sinh trưởng và phát triển của chúng.\nCác triệu chứng của bệnh đốm sọc lá lúa bao gồm các vết đốm trên lá có màu vàng hoặc nâu, có hình dạng dài và chạy dọc theo các gân lá. Những vết đốm này có thể lan ra cả lá và làm cho lá dễ bị hỏng, gây ảnh hưởng đến khả năng hấp thụ ánh sáng của cây lúa và giảm năng suất lúa.\nĐể phòng trị và kiểm soát bệnh đốm sọc lá lúa, người trồng cây lúa có thể áp dụng các biện pháp sau:\nSử dụng các giống lúa có sức đề kháng tốt với bệnh đốm sọc lá lúa.\nĐảm bảo thông gió và quạt gió để giảm độ ẩm trong khu vực trồng lúa.\nVệ sinh định kỳ với các tổ chức cây trồng bằng cách loại bỏ các phần bị nhiễm bệnh và phá hủy chúng.\nPhun thuốc sát khuẩn có chứa đồng hoặc vàng để giảm thiểu sự lây lan của bệnh.\nSử dụng các phương pháp khác như phun chất oải hương, cây phỉ và lá phỉ để chống lại bệnh đốm sọc lá lúa.", 
                    "Việc sử dụng thuốc để kiểm soát bệnh đốm sọc lá trên cây lúa cần phải được thực hiện đúng cách và đảm bảo an toàn cho sức khỏe con người và môi trường. Dưới đây là một số loại thuốc thường được sử dụng để kiểm soát bệnh đốm sọc lá trên cây lúa:\nThuốc Trifloxystrobin + Tebuconazole: Đây là loại thuốc có tác dụng kháng nấm, được sử dụng để phòng và kiểm soát bệnh đốm sọc lá lúa.\nThuốc Epoxiconazole: Đây là một loại thuốc kháng nấm có tác dụng chống lại bệnh đốm sọc lá và các bệnh nhiễm trùng khác trên cây lúa.\nThuốc Difenoconazole: Đây là một loại thuốc kháng nấm cho phép kiểm soát nhiều loại bệnh trên cây lúa, bao gồm bệnh đốm sọc lá.\nLưu ý rằng việc sử dụng thuốc chỉ nên được thực hiện sau khi nghiên cứu kỹ và đảm bảo an toàn trong phòng trị và bảo vệ môi trường, người lao động và người tiêu dùng. Nên tuân thủ đúng hướng dẫn sử dụng trên nhãn nhận của từng sản phẩm và thực hiện theo chỉ dẫn của nhà sản xuất và chuyên gia cây trồng. Trong trường hợp bệnh đốm sọc lá lúa đã lây lan rộng rãi trên cây lúa, cần sử dụng một loạt các phương pháp kiểm soát và xử lý để đạt được hiệu quả tốt nhất."],
    "context_set": ""
    },
    
    {"tag": "blast",
    "patterns": ["Cháy lúa", "Cháy lá lúa", "Bệnh cháy lá lúa", "Bệnh cháy lúa", "Cháy lúa là gì", "Cách xử lý bệnh cháy lúa", "Cách phòng bệnh cháy lúa", "Thuốc xử lý cháy luá"],
    "responses": ["Bệnh cháy lúa là một căn bệnh thường gặp ở các giống lúa khác nhau, gây ra tổn thất lớn cho năng suất và chất lượng lúa. Các triệu chứng của bệnh thường bao gồm các vết đốm trắng ở lá và các bộ phận cây khác, nhưng có thể lan rộng và gây chết cây.\nCó một số cách để phòng và trị bệnh cháy lúa, ví dụ như:\nSử dụng giống lúa kháng bệnh: Nhiều giống lúa đã được chọn tạo ra kháng bệnh trước đó. Việc sử dụng giống lúa đó có thể giảm nguy cơ bị nhiễm bệnh.\nChăm sóc đất và cây trồng cho đúng cách: Tránh sự kẹt nước, đường cong trong thời gian dài và châm nước ở giữa hàng. Bón phân hữu cơ và khoáng chất giúp cải thiện đất và cây trồng khỏe mạnh hơn, đồng thời cải thiện sức đề kháng của cây trồng.\nSử dụng thuốc trừ sâu an toàn: Nếu không trị bệnh cháy lúa một cách hiệu quả, việc sử dụng thuốc trừ sâu là một phương pháp khác để kiểm soát bệnh. Tuy nhiên, cần phải chọn những loại thuốc an toàn để tránh ảnh hưởng đến môi trường và sức khỏe con người.\nGiảm lượng nước tưới cho cây trồng: Vì bệnh cháy lúa thường phát triển trong môi trường ẩm ướt, giảm lượng nước tưới nhằm hạn chế ẩm mốc và tăng sức đề kháng của cây trồng.\nĐiều chỉnh khoảng cách giữa các hàng: Nếu cây lúa quá chật, vi khuẩn và nấm có thể lây lan nhanh hơn. Tăng khoảng cách giữa các hàng giúp cải thiện thông gió và khuếch tán nhiệt độ, giúp giảm nguy cơ bị bệnh cháy lúa.", 
                    "Việc phun thuốc trừ sâu để kiểm soát bệnh cháy lúa cần phải tùy theo loại bệnh và mức độ nhiễm trùng. Tuy nhiên, để phòng chống bệnh cháy lúa, bạn có thể sử dụng các loại thuốc sau đây:\nThuốc tăng cường sức đề kháng cây trồng: Các loại phân bón hữu cơ và khoáng chất như Nitơ, kali, phosphat có thể giúp cải thiện sức đề kháng của cây trồng, giúp chúng chống lại bệnh cháy lúa.\nThuốc fungicide: Thuốc trừ nấm được sử dụng để kiểm soát và ngăn ngừa sự phát triển của các loại nấm gây bệnh cháy lúa. Các thành phần trong fungicide như tebuconazole, tricyclazole, propiconazole và azoxystrobin có tác dụng làm giảm và ngăn chặn hiện tượng mục nát, khô đen tại đốm lá.\nThuốc Bacillus subtilis: Thuốc này được làm từ vi khuẩn có tên Bacillus subtilis, có thể giúp cải thiện sức đề kháng và phòng chống các loại bệnh của cây trồng, bao gồm cả bệnh cháy lúa.\nBạn nên liên hệ với các chuyên gia hoặc nhân viên tư vấn của các trang trại, cửa hàng cây trồng hoặc các tổ chức nông nghiệp để tìm hiểu thêm về những sản phẩm phù hợp và cách sử dụng chúng để đạt hiệu quả tốt nhất trong việc kiểm soát bệnh cháy lúa."],
    "context_set": ""
    },
   
    {"tag": "spot",
    "patterns": ["Đốm nâu", "Đốm nâu trên lá lúa", "Bệnh đốm nâu lúa", "Đốm nâu lúa là gì", "Cách xử lý bệnh đốm nâu lúa", "Cách phòng bệnh đốm nâu lúa", "Thuốc xử lý đốm nâu"],
    "responses": ["Bệnh đốm nâu lúa là một trong những bệnh lúa phổ biến và gây nhiều tổn thất cho năng suất và chất lượng lúa. Bệnh được gây ra do nấm phát triển trên lá, cuống lá, cuống bông và hạt lúa. Bệnh thường xuất hiện vào giai đoạn gốc búa, sinh trưởng nhanh và tán lá. Các triệu chứng của bệnh bao gồm các đốm nâu lớn, hình tròn hoặc không đều trên lá và các bộ phận khác của cây. Những đốm này có thể lan sang lá khác và dần trải rộng NHỮNG BỆNH ĐƯỢC GÂY RA BỞI CHÙM NẤM này có thể làm giảm tỷ lệ hạt, chất lượng và năng suất của lúa.\nCó một số cách để phòng và trị bệnh đốm nâu lúa, bao gồm:\nSử dụng các giống lúa chống bệnh: Nhiều giống lúa đã được chọn lọc và nghiên cứu về kháng bệnh được sử dụng để giảm nguy cơ bị nhiễm bệnh đốm nâu lúa.\nChăm sóc đất và cây trồng cho đúng cách: Điều chỉnh độ pH của đất để tạo điều kiện phát triển cây lúa tốt nhất có thể, đảm bảo rằng cây được tưới nước đúng cách và bón phân thích hợp để củng cố sức đề kháng của cây trồng.\nSử dụng phương pháp đồng canh: Cây lúa được canh tác xen kẽ với các loại cây trồng khác để giảm nguy cơ lây lan bệnh đốm nâu lúa.\nSử dụng thuốc trừ sâu: Nếu bệnh không được kiểm soát đúng cách, việc sử dụng các thuốc tại chỗ có thể giúp giảm sự lan rộng của bệnh trên cây lúa.\nVận động triệu chứng lên lá và bỏ các lá và cây trồng bị nhiễm bệnh: Những lá hoặc cây trồng bị nhiễm bệnh có thể được phát hiện và loại bỏ. Tránh cắt và tỉa cây trồng vào mùa mưa, bởi vì sự tổn thương và chấn thương trên cây có thể tạo điều kiện cho nấm phát triển.", 
                    "Để phòng và trị bệnh đốm nâu lúa, bạn có thể sử dụng các loại thuốc trừ sâu và thuốc trừ nấm đồng thời để kiểm soát bệnh. Tuy nhiên, việc sử dụng các loại thuốc này phải phụ thuộc vào mức độ nhiễm bệnh và loại nấm gây bệnh.\nDưới đây là một số loại thuốc thường được sử dụng để trị bệnh đốm nâu lúa:\nFosetil-Al: Đây là một thuốc trừ nấm có tác dụng ngăn chặn sự phát triển của nấm gây bệnh, giúp ngăn ngừa và kiểm soát dịch bệnh.\nTriadimefon: Đây là một loại thuốc trừ nấm có tác dụng bảo vệ lá khỏi sự phát triển của nấm gây bệnh, giúp kiểm soát và điều trị bệnh đốm nâu lúa.\nCarbendazim: Đây là một loại thuốc trừ nấm có tác dụng ngăn chặn sự phát triển của nấm gây bệnh và kiểm soát dịch bệnh.\nThiophanate-methyl: Đây là một loại thuốc trừ nấm có tác dụng chống lại nhiều loại nấm gây bệnh, giúp kiểm soát và ngăn ngừa sự phát triển của bệnh đốm nâu lúa trên cây trồng.\nChúng tôi khuyến khích bạn nên tham khảo ý kiến ​​của các chuyên gia hoặc nhân viên tư vấn của các cửa hàng chuyên cung cấp thuốc trừ sâu hoặc người có kinh nghiệm trong việc trồng trọt để tìm hiểu thêm về những sản phẩm phù hợp và cách sử dụng chúng để đạt hiệu quả tốt nhất trong việc kiểm soát bệnh đốm nâu của lúa."],
    "context_set": ""
    },

    {"tag": "worm",
    "patterns": ["Sâu đục thân lúa", "Bệnh sâu đục thân lúa", "Sâu đục thân lúa là gì", "Cách xử lý bệnh sâu đục thân lúa", "Cách phòng bệnh sâu đục thân lúa", "Thuốc xử lý sâu đục thân lúa"],
    "responses": ["Bị bệnh sâu đục thân lúa là một trong những vấn đề gặp phải khi trồng lúa. Sâu đục thân lúa là con sâu có hại, chúng ăn rất nhiều thân cây lúa, làm cho thân cây bị suy yếu và có thể chết.\nĐây là một số biện pháp để phòng chống và điều trị bệnh sâu đục thân lúa:\nSử dụng thuốc trừ sâu: Có nhiều loại thuốc trừ sâu có thể sử dụng để tiêu diệt sâu đục thân lúa, nhưng cần chú ý đến liều lượng và thời điểm sử dụng thuốc để tránh ảnh hưởng đến môi trường và sức khỏe con người.\nThực hiện phun thuốc phòng bệnh định kỳ: Thực hiện phun thuốc phòng bệnh định kỳ từ giai đoạn trưởng thành đến khi lúa chín để giảm tỷ lệ sâu đục thân lúa.\nSử dụng phương pháp sinh học: Có thể sử dụng các loài côn trùng hoặc vi khuẩn có tính chất tiêu diệt sâu để phòng chống sâu đục thân lúa.\nThực hiện vệ sinh môi trường: Cần tiêu diệt các thứ có liên quan đến sâu đục thân lúa như lá hoặc các loại cỏ dại trên bãi ruộng.\nChọn giống lúa chống bệnh: Có một số giống lúa được chọn để trồng, chúng đặc biệt kháng được sâu đục thân lúa.\nTất cả các biện pháp trên đều cần thiết phải thực hiện đúng cách để hiệu quả.", 
                    "Để tiêu diệt sâu đục thân lúa, có nhiều loại thuốc trừ sâu có thể sử dụng như:\nChlorpyrifos: Là một loại thuốc trừ sâu được sử dụng để kiểm soát sâu đục thân lúa. Tuy nhiên, cần chú ý đến liều lượng và thời điểm sử dụng thuốc để tránh ảnh hưởng đến môi trường và sức khỏe con người.\nDiazinon: Là một trong những loại thuốc trừ sâu có khả năng tiêu diệt sâu đục thân lúa. Tuy nhiên, cũng cần chú ý đến liều lượng và thời điểm sử dụng thuốc.\nLambda-cyhalothrin: Là loại thuốc trừ sâu có tác dụng nhanh và mạnh, có thể tiêu diệt được sâu đục thân lúa. Tuy nhiên, hiệu quả của thuốc phụ thuộc nhiều vào liều lượng và thời điểm sử dụng thuốc.\nImidacloprid: Là một loại thuốc trừ sâu có khả năng tiêu diệt những con sâu nhỏ, như bọ trĩ và đục thân, không gây nguy hiểm cho con người, vật nuôi và môi trường.\nCần lưu ý rằng các loại thuốc trừ sâu này cần phải sử dụng đúng liều lượng và thời điểm hợp lý để giảm thiểu tác động có hại đến môi trường và con người. Bên cạnh đó cần tuân thủ các quy định về phòng chống sâu bệnh của ngành nông nghiệp."],
    "context_set": ""
    },

    {"tag": "downy",
    "patterns": ["Sương mai", "Bệnh sương mai", "Sương mai lúa là gì", "Cách xử lý bệnh sương mai", "Cách phòng bệnh sương mai", "Thuốc xử lý sương mai lúa"],
    "responses": ["Sương mai lúa là một loại bệnh cảnh của lúa gạo, do nấm Pyricularia oryzae gây ra. Bệnh thường phát triển trong điều kiện thời tiết ẩm ướt và mưa nhiều, làm những đốm nâu trên lá cây lúa, có thể lan sang các bộ phận khác của cây và gây ra chết cây.\nVì vậy, để phòng chống bệnh sương mai, cần chuẩn bị đất trồng tốt, đa dạng hoá trong việc lựa chọn giống lúa, và sử dụng thuốc trừ sâu và thuốc trừ bệnh khi cần thiết. Đồng thời, cần bảo vệ cây lúa trong mùa mưa bằng cách sử dụng các biện pháp phòng ngừa và kiểm soát bệnh tốt hơn.\nTrong trường hợp lúa đã bị nhiễm sương mai, có thể sử dụng các loại thuốc trừ sâu và thuốc phòng bệnh để điều trị tùy theo đặc điểm của từng loại bệnh và tình trạng của cây.\nThông thường, để kiểm soát sương mai trên lúa, có thể sử dụng các loại thuốc có thành phần kali phosphat, kali humate, silic và canxi, đây là những chất làm tăng sức đề kháng của cây trồng để đối phó với các bệnh hại. Các loại thuốc trừ sâu và thuốc phòng bệnh chứa các hoạt chất như Bacillus subtilis, Streptomyces, Azospirillum và Pseudomonas fluorescens cũng được sử dụng để kiểm soát sương mai trên lúa.\nTuy nhiên, cần lưu ý rằng việc sử dụng thuốc trừ sâu và thuốc phòng bệnh cần phải tuân thủ đúng hướng dẫn sử dụng của nhà sản xuất và thực hiện đầy đủ các biện pháp an toàn vệ sinh thực phẩm để đảm bảo an toàn cho người tiêu dùng và môi trường. Ngoài ra, nên tìm hiểu kỹ về tình trạng bệnh trên lúa trước khi sử dụng thuốc để chọn loại thuốc phù hợp nhất."],
    "context_set": ""
    },

    {"tag": "hispa",
    "patterns": ["Bọ gai", "Bọ gai hại lúa", "Bệnh bọ gai hại lúa", "Bệnh bọ gai", "Bọ gai lúa là gì", "Cách xử lý bọ gai", "Cách phòng bọ gai lúa", "Thuốc xử lý bọ gai lúa"],
    "responses": ["Bọ gai là một loại sâu có hại cho cây lúa vì chúng gây tổn hại đến lá và thân cây, dẫn đến giảm năng suất và chất lượng lúa.\nĐây là một số biện pháp để phòng chống và điều trị bệnh bọ gai trên lúa:\nSử dụng thuốc trừ sâu: Có nhiều loại thuốc trừ sâu có thể sử dụng để tiêu diệt bọ gai trên lúa, nhưng cần chú ý đến liều lượng và thời điểm sử dụng thuốc để tránh ảnh hưởng đến môi trường và sức khỏe con người.\nSử dụng phương pháp sinh học: Có thể sử dụng các loài côn trùng hoặc vi khuẩn có tính chất tiêu diệt sâu để phòng chống bọ gai trên lúa.\nThực hiện vệ sinh môi trường: Cần tiêu diệt các thứ có liên quan đến bọ gai như cỏ dại, vụn lá và đồ rác trên các ruộng lúa để giảm khả năng chúng sinh trưởng.\nSử dụng kỹ thuật trồng xen cây: Thay vì trồng lúa liên tiếp, có thể trồng xen cây khác nhau để giảm sự phát triển của bọ gai.\nChọn giống lúa chống bọ gai: Có nhiều giống lúa chịu được tấn công của bọ gai nên nên sử dụng để kiểm soát bệnh.\nTất cả các biện pháp trên đều cần thiết phải thực hiện đúng cách để hiệu quả.", 
                    "Có nhiều loại thuốc trừ sâu có thể được sử dụng để tiêu diệt bọ gai trên lúa. Dưới đây là một số loại thuốc thường được sử dụng để phun trừ sâu cho lúa bị nhiễm bọ gai:\nChlorpyrifos: Là một loại hóa chất trừ sâu có khả năng làm tiêu diệt bọ gai hiệu quả. Tuy nhiên, cần chú ý đến liều lượng và thời điểm sử dụng thuốc để tránh ảnh hưởng đến môi trường và sức khỏe con người.\nImidacloprid: Là một loại hóa chất trừ sâu có tính năng tiêu diệt bọ gai. Thuốc này được sử dụng bằng cách phun trực tiếp lên các bộ phận của cây lúa.\nAcetamiprid: Là một loại hóa chất trừ sâu được sử dụng để kiểm soát bọ gai trên lúa. Thuốc này có thể sử dụng dưới dạng phun sương hoặc phun trực tiếp trên các vết thương của cây.\nThiamethoxam: Là một loại hóa chất trừ sâu có khả năng phòng và trị bệnh bọ gai trên lúa. Thuốc này có thể được sử dụng bằng cách phun trực tiếp lên cây lúa.\nTuy nhiên, việc sử dụng thuốc trừ sâu để trị bệnh bọ gai phải được thực hiện đúng cách và đúng liều lượng để tránh ảnh hưởng đến sức khỏe của con người và môi trường. Cần lưu ý đọc kỹ nhãn thông tin sản phẩm và tuân theo hướng dẫn của các nhà sản xuất thuốc để đạt hiệu quả tốt nhất."],
    "context_set": ""
    },

    {"tag": "tungro",
    "patterns": ["Tungro", "Bệnh tungro", "Vàng lúa do Tungro là gì", "Cách xử lý Tungro", "Cách phòng Tungro", "Thuốc xử lý Tungro"],
    "responses": ["Bệnh virus tungro lúa là một bệnh do virus tungro tấn công cây lúa, gây ra sự suy yếu và giảm năng suất. Virus tungro lúa có thể được truyền qua con ruồi và con muỗi và thường khiến cho màu sắc của lá và quả của cây lúa bị đổi màu và sụp đổ.\nBệnh virus tungro lúa phổ biến ở các khu vực nhiệt đới và cận nhiệt đới trên toàn thế giới, nhất là ở các nước châu Á, trong đó có Việt Nam. Hầu hết các loại lúa bị nhiễm bệnh, và các loài lúa khác cũng có thể bị nhiễm một số loại virus tungro khác.\nCác biện pháp kiểm soát bệnh virus tungro có thể bao gồm:\nKiểm tra và loại bỏ cây lúa bị nhiễm bệnh\nSử dụng các giống lúa chịu được bệnh virus tungro\nSử dụng thuốc trừ sâu, thuốc trừ bệnh để giảm số lượng côn trùng làm trung gian lây nhiễm virus tungro\nTăng cường quản lý đất để giảm bệnh trong đất\nCải tạo môi trường sống của côn trùng và phòng trừ bằng cách sử dụng các binh phòng chống mối độc hại tự nhiên như bã cà phê hữu cơ, xà phòng và hỗn hợp dầu phong.",
                    "Lúa bị tungro là do sự tấn công của loài sinh vật gây hại có tên là virus tungro, không phải do nhiễm bệnh nấm hay vi khuẩn. Vì vậy, việc sử dụng thuốc trừ sâu thông thường không hiệu quả trong việc điều trị bệnh này."],
    "context_set": ""
    }

]}